In [1]:
import pandas as pd 

emp = pd.DataFrame({'empno':[1001, 1002, 1003, 1004, 1005],
                    'ename':['Bruce Wayne', 'James Bond', 'Peter Parker', 'Green Goblin', 'Clarke Kent'],
                    'salary':[10000, 20000, 1200, 5000, 2500]
                    'locid': [101, 102, 103, 101, 104]})

SyntaxError: invalid syntax (<ipython-input-1-553d55082f9c>, line 6)

In [10]:
import numpy as np
import pandas as pd

df = pd.DataFrame([[1, 2, 3],
                   [4, 5, 6],
                   [7, 8, 9],
                   [np.nan, np.nan, np.nan]],
                   columns=['A', 'B', 'C'])

df
df1 = df.iloc[:, :-1]
df1
type(df1)

pandas.core.frame.DataFrame

In [4]:
df.agg(['sum', 'min'])

        A     B     C
sum  12.0  15.0  18.0
min   1.0   2.0   3.0

In [8]:
df.agg({'A' : ['sum', 'min'], 'B' : ['min', 'max']})

        A    B
max   NaN  8.0
min   1.0  2.0
sum  12.0  NaN

In [9]:
df.agg("mean", axis="columns")

0    2.0
1    5.0
2    8.0
3    NaN
dtype: float64

In [3]:
#df.agg({'rating':[np.size,np.mean]})
#df.agg({'A':[np.size,np.mean]})

In [ ]:

#Try Out difference types of joins